/* No comment provided by engineer. */
"AUTHENTICATION_ERROR" = "You must be Authenticated";

/* No comment provided by engineer. */
"BAD_REQUEST" = "Bad Request";

/* No comment provided by engineer. */
"COULD_NOT_PARSE" = "Unable to parse the JSON response";

/* No comment provided by engineer. */
"DATA_TASK_FAILED" = "The Data Task object failed";

/* No comment provided by engineer. */
"DECODING_FAILED" = "Unable to Decode the data";

/* No comment provided by engineer. */
"ENCODING_FAILED" = "Parameter Encoding failed";

/* No comment provided by engineer. */
"FAILED" = "Network Request failed";

/* No comment provided by engineer. */
"FRAGMENT_RESPONSE" = "The API's response's body has fragments";

/* No comment provided by engineer. */
"HEADERS_NIL" = "Headers are Nil";

/* No comment provided by engineer. */
"MISSING_URL" = "The URL is nil";

/* No comment provided by engineer. */
"NO_DATA" = "The data from API is Nil";

/* No comment provided by engineer. */
"PAGE_NOT_FOUND" = "Page/Route rquested not found.";

/* No comment provided by engineer. */
"PARAMETERS_NIL" = "Parameters are Nil";

/* No comment provided by engineer. */
"SERVER_SIDE_ERROR" = "Server error";

/* No comment provided by engineer. */
"SUCCESS" = "Successful Network Request";

/* No comment provided by engineer. */
"UNWRAPPING_ERROR" = "Unable to unwrape the data";

